<?php

/**
 * Ukrainian Language File for the Users Module (users.ua.lang.php)
 *
 * @package Cotonti
 * @copyright (c) Cotonti Team
 * @license https://github.com/Cotonti/Cotonti/blob/master/License.txt
 * @Ukrainian translate by Igor Ostapchuk
 */

defined('COT_CODE') or die('Wrong URL.');

/**
 * User authentication
 */
$L['users_nameormail'] = 'Імя або email';
$L['users_rememberme'] = 'Запомнити мене';
$L['users_lostpass'] = 'Відновити пароль';
$L['users_maintenance1'] = 'Сайт в режимі обслуговування';
$L['users_maintenance2'] = 'Вхід тілько для адміністраторів і дозволених груп';
$L['users_loggedinas'] = 'Ви ввійшли як';
$L['users_logoutfirst'] = 'Щоб ввійти в інший акаунт, вам потрібно спочатку вийти.';

/**
 * User registration
 */
$L['users_validemail'] = 'Діючий e-mail';
$L['users_validemailhint'] = '(необхідний для підтвердження реєстрації)';
$L['users_confirmpass'] = 'Підтвердити пароль';

$L['aut_contactadmin'] = 'У випадку необхідності звяжіться з адміністратором';
$L['aut_emailalreadyindb'] = 'Такий e-mail вже існує в базі даних';
$L['aut_emailbanned'] = 'Даний e-mail (або хост) заблокований. Причина: ';
$L['aut_emailtooshort'] = 'Помилковий e-mail';
$L['aut_invalidloginchars'] = 'Логін містить недопустимі символи';
$L['aut_logintitle'] = 'Авторизація';
$L['aut_mailnoticetitle'] = 'Зміна e-mail';
$L['aut_passwordmismatch'] = 'Введені паролі не співпадають';
$L['aut_passwordtooshort'] = 'Пароль повинний складатися з 4 або більше символів: букв, цифр ';
$L['aut_registersubtitle'] = 'Заповніть реєстраційну форму за вказаними параметрами';
$L['aut_registertitle'] = 'Реєстрація нового користувача';
$L['aut_regreqnoticetitle'] = 'Запит на реєстрацію нового облікового запису';
$L['aut_regrequesttitle'] = 'Реєстрація нового користувача';
$L['aut_usernamealreadyindb'] = 'Користувач з таким іменем вже існує у базі даних';
$L['aut_usernametooshort']= 'Імя користувача має складатися з 2-х або більше символів/букв';

/**
 * User registration: messages
 */
$L['aut_regrequest'] = "Вельмишановний, %1\$s,\nВаш обліковий запис на даний момент ще не активована. Перед тим як ви зможете авторизуватися, адміністратор сайту повинний активувати ваш обліковий запис, після цього вам буде відправлено ще одне підтвердження.";

$L['aut_regreqnotice'] = "Дане повідомлення надіслано вам після запиту реєстрації облікового запису користувача %1\$s.\nКористувач %1\$s не зможе авторизуватися до тих пір, поки його обліковий запис не буде активований по наступної ссилці:\n%2\$s";

$L['aut_emailreg'] = "Вельмишановний, %1\$s,\nВам необхідно активувати обліковий запи, використовуючи наступну ссилку:\n%2\$s\nЧтобы отменить активацию учетной записи воспользуйтесь следующей ссылкой:\n%3\$s";

$L['aut_emailchange'] = "Вельмишановний, %1\$s,\n Для того щоб змінити ваш e-mail адрес, перейдіть по цьому посиланню:\n%2\$s";

/**
 * User list
 */
$L['users_usersperpage'] = 'Користувачів на сторінку';
$L['users_usersinthissection'] = 'Всього користувачів';

$L['pro_emailandpass'] = 'Ви не можете змінити і e-mail, і пароль одночасно';
$L['pro_passdiffer'] = 'Введені паролі не співпадають';
$L['pro_passtoshort'] = 'Пароль повинний складатися з 4-х або більше символів: букв, цифр';
$L['pro_subtitle'] = 'Налаштування ваших особистих даних';
$L['pro_title'] = 'Ваш обліковий запис';
$L['pro_wrongpass'] = 'Ви не ввели поточний пароль або він невірний';
$L['pro_invalidbirthdate'] = 'Невірна дата народження';

$L['useed_accountactivated'] = 'Обліковий запис активований';
$L['useed_email'] = 'Дане повідомлення надіслане вам післе активації вашого облікового запису. Тепер ви можете авторизуватися на сайті, використовуючи своє імя користувача та пароль.';
$L['useed_subtitle'] = '&nbsp;';
$L['useed_title'] = 'Редагування';

$L['use_allbannedusers'] = 'Заблоковані облікові записи';
$L['use_allinactiveusers'] = 'Неактивовані обліковані записи';
$L['use_allusers'] = 'Всі пользователи';
$L['use_byfirstletter'] = 'Імена користувачів на';
$L['use_subtitle'] = 'Зареєстровані користувачі';
$L['use_title'] = 'Користувачі';

$L['pasrec_title'] = 'Відновлення пароля';
$L['pasrec_email1'] = "Вельмишановний, %1\$s,\nВикористовуйте вказану нижче посилання для зміни пароля:\n%2\$s\n\nУвага: якщо ви не зверталися за зміною пароля, повідомляємо вам, що запит був зроблений %4\$s з IP-адресу %3\$s.";
$L['pasrec_email2'] = 'За вашим запитом був створений новий пароль. Змініть його при першій ж можливості і видаліть це повідомлення. Ваш новий пароль: ';
$L['pasrec_explain1'] = 'Введіть ваш email.';
$L['pasrec_explain2'] = 'Отримавши повідомлення, скористайтеся посиланням для зміни паролю.';
$L['pasrec_explain3'] = 'Двічі підтвердивши зміну пароля, ви отримаєте email з паролем, згенерованим випадковим чином.';
$L['pasrec_explain4'] = 'Якщо ви очистили поле email\'а в своєму профілі, відновити пароль самостійно ви не зможете. В цьому випадку вам необхідно надіслати Email адміністратору сайту.';
$L['pasrec_mailsent'] = 'Повідомлення відправлено. Перевірте свій email та скористайтеся відправленим вам посиланням. Після цього слідуйте інструкціям по встановленню нового пароля.';
$L['pasrec_mailsent2'] = 'Пароль було змінено. Буль ласка, перевірте ваш email через кілька хвилин, щоб отримати новий пароль.';
$L['pasrec_request'] = 'Запит';
$L['pasrec_youremail'] = 'Ваший email: ';

/**
 * User details
 */
$L['users_sendpm'] = 'Відправити особисте повідомлення';

/**
 * User profile & edit
 */
$L['users_id'] = 'ID користувача';
$L['users_hideemail'] = 'Приховувати e-mail';
$L['users_pmnotify'] = 'Повідомляти про нові особисті повідомлення';
$L['users_pmnotifyhint'] = '(отримувати e-mail увідомлення при отримані нового особистого повідомлення)';
$L['users_newpass'] = 'Встановити новий пароль';
$L['users_newpasshint1'] = '(Залиште порожнім щоб зберегти поточний)';
$L['users_newpasshint2'] = '(введіть новий пароль двічі)';
$L['users_oldpasshint'] = '(введіть свій поточний пароль щоб встановити новий)';
$L['users_lastip'] = 'Останній IP';
$L['users_logcounter'] = 'Всього авторизацій';
$L['users_deleteuser'] = 'Видаити користувача';
$L['users_changeemail'] = 'Змінити E-mail';

/**
 * Miscellaneous
 */
$L['users_group_not_found'] = 'Група не знайдена';

/**
 * Moved from theme.lang
 */
$themelang['usersprofile_Emailpassword'] = 'Ваш поточний пароль';
$themelang['usersprofile_Emailnotes'] = '<p><b>Порядок зміни e-mail (якщо дозволено администратором и при обязательном подтверждении нового e-mail):</b></p><ol><li>Действие вашего текущего e-mail будет приостановлено</li><li>В целях безопасности вам необходимо указать текущий пароль для доступа к учетной записи</li><li>Для подтверждения нового e-mail вам необходимо повторно активировать учетную запись по электронной почте</li><li>До подтверждения нового e-mail действие вашей учетной записи будет приостановлено</li><li>После подтверждения нового e-mail ваша учетная запись будет вновь активирована</li><li>Будьте аккуратны при вводе нового e-mail: в случае ошибки вы не сможете его исправить</li><li>Если вы все-таки допустили ошибку при вводе нового e-mail, обратитесь к администратору.</li></ol><p><b>При отсутствии обязательного подтверждения нового e-mail, изменения вступают в силу немедленно.</b></p>';

/**
 * Users full name display format
 */
$R['users_full_name'] = '{$lastname} {$firstname} {$middlename}';
